# SetDLControlOffset

## Description
Sets the Double Line Preferences control offset.

```pascal
PROCEDURE SetDLControlOffset(controlOffsetDistance : REAL (Coordinate));
```

```python

def vs.SetDLControlOffset(controlOffsetDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|controlOffsetDistance|REAL (Coordinate)|The control offset.|

## See Also
VS Functions:
GetDLControlOffset

## Version
Availability: from VectorWorks12.5
## Category
* Document Settings